<a href="https://colab.research.google.com/github/SinghAbh1shek/Pandas/blob/main/Pandas_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Series: It's a one dimentional array-like structure in Pandas that can hold sequence of value of any data type. Each value in a series is linked with associated label, knowns as the Index. We can also customized the index label in the series

create a series from scalar value with the custom index

In [ ]:
import pandas as pd

In [ ]:
series_scalar = pd.Series(20, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g'])
print(series_scalar)

a    20
b    20
c    20
d    20
e    20
f    20
g    20
dtype: int64

In [ ]:
series_scalar['c']

np.int64(20)

In [ ]:
data = [10, 20, 30, 40, 50, 60, 70, 80, ]
series_from_list = pd.Series(data)
series_from_list1 = pd.Series(data, index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(series_from_list)
print(series_from_list1)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64
a    10
b    20
c    30
d    40
e    50
f    60
g    70
h    80
dtype: int64

In [ ]:
import numpy as np
arr = np.array([10, 20, 30, 40, 50, 60])
series_from_array = pd.Series(arr)
series_from_array

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [ ]:
data_dict = {"a":1, 'b':2, 'c':3, 'd':4, 'e':6}
series_from_dict = pd.Series(data_dict)
print(series_from_dict)

a    1
b    2
c    3
d    4
e    6
dtype: int64

In [ ]:
print(series_from_dict[1:4])
print(series_from_dict['b':'d'])

b    2
c    3
d    4
dtype: int64
b    2
c    3
d    4
dtype: int64

# Attributes in series data structure

In [ ]:
data = [ 'New Delhi', 'Washington', 'Paris', 'London']
index = ['India', 'USA', 'France', 'UK']

In [ ]:
series_capital_country = pd.Series(data, index=index)
series_capital_country

India      New Delhi
USA       Washington
France         Paris
UK            London
dtype: object

In [ ]:
print("Index of the series_capital_country")
print(series_capital_country.index)

Index of the series_capital_country
Index(['India', 'USA', 'France', 'UK'], dtype='object')

In [ ]:
print("Values of the series_capital_country")
print(series_capital_country.values)
print(series_capital_country.empty)

Values of the series_capital_country
['New Delhi' 'Washington' 'Paris' 'London']
object
(4,)
4
False

In [ ]:
print("type of the series_capital_country")
print(series_capital_country.dtype)

type of the series_capital_country
object

In [ ]:
print("shaoe and size of the series_capital_country")
print(series_capital_country.shape)
print(series_capital_country.size)

shaoe and size of the series_capital_country
(4,)
4

In [ ]:
print("IS series_capital_country empty?")
print(series_capital_country.empty)

IS series_capital_country empty?
False

In [ ]:
print("Is series_capital_country contains NaN?")
print(series_capital_country.hasnans)

Is series_capital_country contains NaN?
False

In [ ]:
print("Is series_capital_country contains unique elements?")
print(series_capital_country.is_unique)

Is series_capital_country contains unique elements?
True

In [ ]:
print("Dimentions series_capital_country contains?")
print(series_capital_country.ndim)

Dimentions series_capital_country contains?
1

# Method in series data structure

In [ ]:
series_capital_country.head(2)

India     New Delhi
USA      Washington
dtype: object

In [ ]:
series_capital_country.tail(2)

France     Paris
UK        London
dtype: object

In [ ]:
marks = [33, 52, 55, 34, 42, 51]
students = ['Rahul', 'Subham', 'Aman', 'Sumit', 'Shivam', 'Ashu']

series_students = pd.Series(marks, index=students)
series_students

Rahul     33
Subham    52
Aman      55
Sumit     34
Shivam    42
Ashu      51
dtype: int64

In [ ]:
series_students.describe()

count     6.000000
mean     44.500000
std       9.565563
min      33.000000
25%      36.000000
50%      46.500000
75%      51.750000
max      55.000000
dtype: float64

values_count()

In [ ]:
series_students.value_counts()

33    1
52    1
55    1
34    1
42    1
51    1
Name: count, dtype: int64

In [ ]:
series_students.drop('Sumit')   # It's doesn't change the original data

Rahul     33
Subham    52
Aman      55
Sumit     34
Shivam    42
Ashu      51
dtype: int64

In [ ]:
series_students

Rahul     33
Subham    52
Aman      55
Sumit     34
Shivam    42
Ashu      51
dtype: int64

In [ ]:
series_students.drop('Sumit', inplace=True)   # Now its changes the original data

In [ ]:
series_students

Rahul     33
Subham    52
Aman      55
Shivam    42
Ashu      51
dtype: int64

In [ ]:
series_students['Subham'] = 71
series_students

Rahul     33
Subham    71
Aman      55
Shivam    42
Ashu      51
dtype: int64

isnull() -> Detect the missing value

In [ ]:
print(series_students.isnull())

Rahul     False
Subham    False
Aman      False
Sumit     False
Shivam    False
Ashu      False
dtype: bool

In [ ]:
print(series_students.isnull().sum())

0

# Mathemetical Operations on series

In [ ]:
marks = [33, 52, 55, 34, 42, 51]
students = ['Rahul', 'Subham', 'Aman', 'Sumit', 'Shivam', 'Ashu']

series_students = pd.Series(marks, index=students)
series_students

Rahul     33
Subham    52
Aman      55
Sumit     34
Shivam    42
Ashu      51
dtype: int64

In [ ]:
marks1 = [43, 42, 35, 38, 72, 33]
students1 = ['Manoj', 'Sumit', 'Vivek', 'Subh', 'Vikash', 'Ashu']

series_students_1 = pd.Series(marks1, index=students1)
series_students_1

Manoj     43
Sumit     42
Vivek     35
Subh      38
Vikash    72
Ashu      33
dtype: int64

In [ ]:
print(series_students + series_students_1)

Aman       NaN
Ashu      84.0
Manoj      NaN
Rahul      NaN
Shivam     NaN
Subh       NaN
Subham     NaN
Sumit     76.0
Vikash     NaN
Vivek      NaN
dtype: float64

In [ ]:
print(series_students - series_students_1)

Aman       NaN
Ashu      18.0
Manoj      NaN
Rahul      NaN
Shivam     NaN
Subh       NaN
Subham     NaN
Sumit     -8.0
Vikash     NaN
Vivek      NaN
dtype: float64

In [ ]:
print(series_students * series_students_1)

Aman         NaN
Ashu      1683.0
Manoj        NaN
Rahul        NaN
Shivam       NaN
Subh         NaN
Subham       NaN
Sumit     1428.0
Vikash       NaN
Vivek        NaN
dtype: float64

In [ ]:
print(series_students / series_students_1)

Aman           NaN
Ashu      1.545455
Manoj          NaN
Rahul          NaN
Shivam         NaN
Subh           NaN
Subham         NaN
Sumit     0.809524
Vikash         NaN
Vivek          NaN
dtype: float64